#include "h8-3052-iodef.h"
/* #include "h8-3052-int.h" */
#include "da.h"
#include "lcd.h"

#define TCONST40us 100*6
#define TCONST1ms 2500*10
#define TCONST1_10ms 2500
#define TCONST1_100ms 250
#define TCONST1_1000ms 25

#define RA	66

void wait1_10ms(int ms);
void wait1_100ms(int ms);
void sound(int vol,int div);
void wait1_1000ms(int ms);
void sound_sin(int vol,int div);

unsigned char sin_data[360] = {127,129,131,133,135,138,140,142,144,146,149,151,153,155,157,159,162,164,166,168,170,172,174,176,178,180,182,184,186,188,190,192,194,196,198,199,201,203,205,206,208,210,211,213,215,216,218,219,221,222,224,225,227,228,229,231,232,233,234,235,236,238,239,240,241,242,243,243,244,245,246,247,247,248,249,249,250,250,251,251,252,252,252,253,253,253,253,253,253,253,254,253,253,253,253,253,253,253,252,252,252,251,251,250,250,249,249,248,247,247,246,245,244,243,243,242,241,240,239,238,236,235,234,233,232,231,229,228,227,225,224,222,221,219,218,216,215,213,211,210,208,206,205,203,201,199,198,196,194,192,190,188,186,184,182,180,178,176,174,172,170,168,166,164,162,159,157,155,153,151,149,146,144,142,140,138,135,133,131,129,127,125,123,121,119,116,114,112,110,108,105,103,101,99,97,95,92,90,88,86,84,82,80,78,76,74,72,70,68,66,64,62,60,58,56,55,53,51,49,48,46,44,43,41,39,38,36,35,33,32,30,29,27,26,25,23,22,21,20,19,18,16,15,14,13,12,11,11,10,9,8,7,7,6,5,5,4,4,3,3,2,2,2,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,2,2,2,3,3,4,4,5,5,6,7,7,8,9,10,11,11,12,13,14,15,16,18,19,20,21,22,23,25,26,27,29,30,32,33,35,36,38,39,41,43,44,46,48,49,51,53,55,56,58,60,62,64,66,68,70,72,74,76,78,80,82,84,86,88,90,92,95,97,99,101,103,105,108,110,112,114,116,119,121,123,125};

int main(void)
{
	da_init();

	sound_sin(0,91);

	return 0;
}

void sound_sin(int vol,int div)
{
	unsigned char data[360];
	int wcount;
	int deg;

	speaker_switch(SPEAKER);
	for(;;)
	{
		for(deg=0;deg<360;deg+=16)
		{
			da_out(0,sin_data[deg]);
			for(wcount=div;wcount>0;wcount--);
		}
	}

}

void sound(int vol,int div)
{
	speaker_switch(SPEAKER);

	for(;;)
	{
		da_out(0,vol);
		wait1_100ms(div);
		da_out(0,0);
		wait1_100ms(div);
	}
}

void wait1_10ms(int ms)
     /* ms = 1 のとき, 約1msだけムダなループで待つ関数            */
     /* LCDの動作を保証するために必要な時間を確保するのが目的     */
     /* この間, CPUを独占するので注意し, 他の用途に使用しないこと */
{
  int i,j;

  for (i = 0; i < ms; i++){
    for (j = 0; j < TCONST1_10ms; j++);
  }
}

void wait1_100ms(int ms)
     /* ms = 1 のとき, 約1msだけムダなループで待つ関数            */
     /* LCDの動作を保証するために必要な時間を確保するのが目的     */
     /* この間, CPUを独占するので注意し, 他の用途に使用しないこと */
{
  int i,j;

  for (i = 0; i < ms; i++){
    for (j = 0; j < TCONST1_100ms; j++);
  }
}

void wait1_1000ms(int ms)
     /* ms = 1 のとき, 約1msだけムダなループで待つ関数            */
     /* LCDの動作を保証するために必要な時間を確保するのが目的     */
     /* この間, CPUを独占するので注意し, 他の用途に使用しないこと */
{
  int i,j;

  for (i = 0; i < ms; i++){
    for (j = 0; j < TCONST1_1000ms; j++);
  }
}
